app/controllers/post_images_controller.rb

INSERT INTO "post_images" ("shop_name", "image_id", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["shop_name", "rails"], ["image_id", nil], ["caption", "asdfg"], ["user_id", 1], ["created_at", "2021-03-17 05:09:01.519920"], ["updated_at", "2021-03-17 05:09:01.519920"]]
---
  def create
   @post_image = PostImage.new(post_image_params)
   @post_image.user_id = current_user.id
   if @post_image.save

SELECT  "post_images".* FROM "post_images" ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
   @post_images = PostImage.page(params[:page]).reverse_order